[{"key":"mob_login_ViewTitle","value":"تسجيل الدخول"},{"key":"mob_login_Login","value":"تسجيل الدخول"},{"key":"mob_login_NotAMember ","value":"ليس عضوا ؟"},{"key":"mob_login_SignUp","value":"إنشاء حساب"},{"key":"mob_signUp_ViewTitle","value":"تسجيل"},{"key":"mob_signUp_Register","value":"تسجيل"},{"key":"mob_signUp_Login","value":"تسجيل الدخول"},{"key":"mob_home_ViewTitle","value":"الصفحة الرئيسية"},{"key":"mob_home_Partners","value":"شركاء"},{"key":"mob_home_SpendPoints","value":"استخدام النقاط"},{"key":"mob_home_Deals","value":"العروض المميزة"},{"key":"mob_home_Travel","value":"BLU السفر مع"},{"key":"mob_leftMenu_MyCountry","value":"البلد"},{"key":"mob_leftMenu_MyProfile","value":"الصفحة الشخصية"},{"key":"mob_leftMenu_ChangePin","value":"تغيير الرمز الشخصي"},{"key":"mob_leftMenu_MyStatement","value":"كشف الحساب"},{"key":"mob_leftMenu_MyFavorites","value":"المفضلات"},{"key":"mob_leftMenu_TrasnferPoints","value":"تحويل النقاط"},{"key":"mob_leftMenu_Cashback","value":"إسترجاع نقدي"},{"key":"mob_leftMenu_MyCart","value":"سلة التسوق"},{"key":"mob_rightMenu_AboutUs","value":"عن الشركة"},{"key":"mob_rightMenu_MemberTerms","value":"الشروط والأحكام"},{"key":"mob_rightMenu_PrivacyPolicy","value":"الخصوصية"},{"key":"mob_rightMenu_FAQ","value":"الأسئلة المتكررة"},{"key":"mob_rightMenu_ContactUs","value":"اتصل بنا"},{"key":"mob_rightMenu_LikeUs ","value":"تابعنا"},{"key":"mob_rightMenu_SignOut","value":"الخروج"},{"key":"mob_myCountry_ViewTitle","value":"البلد"},{"key":"mob_myCountry_Update","value":"تحديث"},{"key":"mob_myProfile_ViewTitle","value":"الصفحة الشخصية"},{"key":"mob_myProfile_DateOfBirth ","value":"تاريخ الولادة"},{"key":"mob_myProfile_MaritalStatus","value":"الوضع العائلي"},{"key":"mob_myProfile_Save","value":"حفظ"},{"key":"mob_changePin_ViewTitle","value":"تغيير الرمز الشخصي"},{"key":"mob_changePin_ChangePin","value":"تغيير الرمز الشخصي"},{"key":"mob_myStatement_ViewTitle","value":"كشف الحساب"},{"key":"mob_myStatement_PeriodSelection","value":"الفترة"},{"key":"mob_myStatement_TotalPointsEarned","value":"مجموع النقاط المستحقة"},{"key":"mob_myStatement_TotalPointsRedeemed","value":"مجموع النقاط المستخدمة"},{"key":"mob_myStatement_NetBalance","value":"الرصيد الباقي"},{"key":"mob_myStatement_Date","value":"التاريخ"},{"key":"mob_myStatement_Partner","value":"الشريك"},{"key":"mob_myStatement_Points","value":"نقطة"},{"key":"mob_myFavorites_ViewTitle","value":"المفضلات"},{"key":"mob_myFavorites_Search","value":"بحث"},{"key":"mob_transferPoints_ViewTitle","value":"تحويل النقاط"},{"key":"mob_transferPoints_AmountToTransferPlaceholder","value":"المبلغ للتحويل"},{"key":"mob_transferPoints_CountryCodePlaceholder","value":"الرمز"},{"key":"mob_transferPoints_RecipientMobilePlaceholder","value":"رقم هاتف المستلم"},{"key":"mob_transferPoints_PinPlaceholder","value":"أدخل الرمز الشخصي"},{"key":"mob_transferPoints_Confirm","value":"تأكيد"},{"key":"mob_myCart_ViewTitle","value":"سلة التسوق"},{"key":"mob_myCart_Search","value":"بحث"},{"key":"mob_myCart_Proceed","value":"واصل"},{"key":"mob_myCart_TotalItems","value":"مجموع المنتجات"},{"key":"mob_myCart_SubTotal","value":"المجموع الفرعي(باستثناء تكاليف التوصيل)"},{"key":"mob_myCartDeliveryAddress_ViewTitle","value":"عنوان التسليم"},{"key":"mob_myCartDeliveryAddress_Title","value":"أدخل تفاصيل التوصيل"},{"key":"mob_myCartOrderSummary_ViewTitle","value":"ملخص الطلب"},{"key":"mob_myCartOrderSummary_DeliveryAddress","value":"عنوان التسليم"},{"key":"mob_myCartOrderSummary_Points","value":"نقطة"},{"key":"mob_myCartOrderSummary_Quantity","value":"العدد"},{"key":"mob_myCartOrderSummary_Shipping","value":"تكاليف التوصيل"},{"key":"mob_myCartOrderSummary_Total","value":"المجموع"},{"key":"mob_myCartOrderSummary_TotalItems","value":"مجموع المنتجات"},{"key":"mob_myCartOrderSummary_SubTotal","value":"المجموع (مع تكاليف التوصيل):"},{"key":"mob_aboutUs_ViewTitle","value":"عن الشركة"},{"key":"mob_aboutUs_AboutUs","value":"BLU is a universal loyalty program that allows you to earn and redeem points instantly, any time and anywhere within the BLU network and on the BLU online catalog. The BLU network will include a wide range of BLU partners, like supermarkets, gas stations, electronic stores, travel agencies, banks and so on, where you will be able to earn BLU Points when you make a purchase. You can then redeem your BLU Points at any one of those partners or on the BLU online catalog. You will recognize a BLU partner whenever you see the BLU sign on the door or on the counter. In addition, if your bank is a BLU partner, you may be issued a BLU credit or debit card. This way, by using it when shopping within the BLU network, you will double the points you earn and you will be on your way to collecting points faster than ever! The BLU network will never stop growing and you will soon find us when you travel and shop abroad. Now that's an exciting loyalty program!"},{"key":"mob_memberTerms_ViewTitle","value":"الشروط والأحكام"},{"key":"mob_memberTerms_MemberTerms","value":"1\tINTRODUCTION AND DEFINITIONS\r\n1.1 These Member Terms (including our BLU Privacy Policy) govern the collection and use of BLU Points, the membership of the BLU Points Program and the use of BLU’s website and Mobile Application. These Terms may be changed or updated occasionally to meet the requirements and standards. Therefore Members are encouraged to frequently visit these sections in order to be updated about the changes made to these Terms. Modifications will be effective on the day they are posted.\r\n1.2\tFor the purpose of these Member Terms, the following terms shall have the following meaning:\r\n1.2.1\tMember Terms – the terms set out herein;\r\n1.2.2\tMember – means the person who is a member of the BLU Points Program and whose name is registered against the Membership Number;\r\n1.2.3\tProgram Partner – means any business participating in the BLU Points Program to offer BLU Points or Rewards to Members\r\n1.2.4\tBLU Points Program – means the loyalty program operated by us pursuant to which Members earn BLU Points from Program Partners and spend them on Rewards;\r\n1.2.5\tMembership Number – means the membership number allocated to a Member in accordance with these Member Terms;\r\n1.2.6\tBLU Points – means the common loyalty currency issued and redeemed by Program Partners across the BLU Points Program;\r\n1.2.7\tBLU Account – an account number that is set up under one Membership Number and which is used by Member within the BLU Points Program to earn and redeem points;\r\n1.2.8\tBLU Card – means, where issued, a Membership card;\r\n1.2.9\tReward(s) – goods or services supplied, by or on behalf of us, upon redemption by a Member of an appropriate number of BLU Points or, where permitted, a combination of cash and BLU Points;\r\n1.2.10\tCoupon – a digital number obtained through a redemption process and used to redeem for a specific goods or services at Program Partners or Suppliers;\r\n1.2.11\tPIN Code –a four-digit number sent to Member at the time of enrollment and used for redemption purposes\r\n1.2.12\tBLU, we, us, our – mean BLU Solutions Limited, a company established in the British Virgin Islands, having its address at c\/o CCS Trustees Limited, 265 Main Street, Road Town, Tortola, British Virgin Islands; and\r\n1.2.13\tWebsite and Mobile application – mean the pages and the screens applicable to the BLU Points Program available at www.blupoints.com and on the iOS and Android app stores.\r\n2\tMEMBERSHIP ENROLLMENT\r\n2.1\tA Member can enroll in the BLU Points Program by registering online at www.blupoints.com, through the BLU mobile application available on the Apple and Android mobile application stores or at businesses participating in the BLU Points Program (“Program Partners”). Once registered, Member can start earning BLU Points across the program network;\r\n2.2\tMember may be issued a BLU Card, which the Member can use to identify him\/herself to the Program Partner to earn or redeem BLU Points or to avail of any service offered to Members;\r\n2.3\tWe will set up a BLU Account to record BLU Points earned or redeemed by the Member. Points can only be redeemed once the BLU Account is activated by using the PIN at Program Partner locations or by entering it online on the Website;\r\n2.4\tA Member by registering and becoming a Member in the BLU Points Program agrees to receive marketing information from us or be contacted by us for promotional purposes in connection with the BLU Points Program and\/or by participating companies;\r\n3\tPOINTS COLLECTION\r\n3.1\tBLU has Program Partners through whom Member earns BLU Points. We award Points when one of our Program Partners tells us a Member has undertaken a relevant transaction with them. (“Suppliers”) are companies with whom a Member can redeem BLU Points to obtain Rewards. These participating companies may change - an up to date list of Program Partners and Suppliers is available from us at any time. Program Partners determine the particular transactions on which BLU Points can be earned and the number of BLU Points to be earned. There is a set number of BLU Points needed to obtain a Reward. Each of these will change but in most cases there will be a base offer with further bonus offers that come and go. We cannot control every specific change in the participating companies or their offers but we will ensure that while BLU is in operation a range of offers is available;\r\n3.2 BLU Points are earned for purchases with any other Program Partner if a Member presents his\/her BLU Card or the Membership Number or other required information before entering into a transaction on which such other Program Partner offers BLU Points;\r\n3.3\tBLU Points cannot be redeemed until credited to a BLU Account. Program Partners will take different periods to notify us of BLU Points to be credited. We are not responsible for a failure, delay or error by a Program Partner notifying us of BLU Points to be credited;\r\n3.4\tBLU Points can be transferred to another BLU Account. The transfer will be subject to a transfer fee equivalent to 5% of the amount of the points transferred or 100 (one hundred) BLU Points, whichever is greater;\r\n3.5\tBLU Points can only be earned, held, transferred or redeemed as set out in these Member Terms. Any other use, award, sale, exchange or transfer of BLU Points, or attempt to do so, is a serious breach of these Member Terms. Any BLU Points not earned and held in accordance with these Member Terms will be invalid and cannot be redeemed for Rewards. Any such BLU Points on a BLU Account will be deducted and, if they are redeemed, we will ask the Supplier to cancel the relevant Rewards and we may take other appropriate action. BLU Points have no cash value;\r\n3.6\tA Member who continues to collect will get a regular update of the BLU Points position as we know it on the date we issue the update in respect of his\/her BLU Account including the BLU Points collected and redeemed by such Member on such BLU Account. Account information is also available from us and can be accessed on the Website or through the Mobile Application. We will correct a BLU Account if it is shown to our reasonable satisfaction to be wrong but, unless there are clear records showing this, our decision is final;\r\n3.7\tBLU reserves the right to reverse the BLU points credit issued by any partner, who discontinues operating within BLU for any reason;\r\n4\tREDEMPTION AND REWARDS\r\n4.1\tAll Rewards are subject to availability and stocks may be limited. Transactions on which BLU Points are earned or redeemed are made directly with the relevant Program Partner or Supplier and we have no responsibility for the delivery, standard, quality or otherwise of any goods and services received or supplied or the failure of a Supplier to honor a redemption or make a specific Reward available. These transactions and all Rewards are subject to all applicable legal terms and the terms and conditions (including booking requirements, cancellation restrictions, return conditions, warranties and limitations of liability) of the Program Partner or Supplier. When BLU Points are redeemed we may act as intermediary between the relevant Member and the Supplier and\/or Program Partner and we will do what we can to ensure such Rewards are supplied by the relevant Supplier and\/or Program Partner;\r\n4.2\tThe number of BLU Points required to redeem any Reward found on the Website or at a Program Partner location may change without prior notice;\r\n4.3\tAt the time of requesting the reward, Member’s current BLU Points balance must be at least equal to the total BLU Points value that the Reward Member is requesting. Reward offers cannot be used in conjunction with any other Reward Supplier offers unless otherwise stated;\r\n4.4\tOnce a Reward has been delivered or picked up, it cannot be returned or exchanged for BLU Points or other Rewards;\r\n4.5\tIf a product is out of stock, BLU will suggest a replacement and it is the Member’s decision to accept or refuse the replacement. Where a replacement is not taken then the BLU Points will be credited back into Member’s account within 10 working days after notifying us;\r\n4.6\tIf the Reward is faulty, the Supplier’s warranty will apply and the Member must revert to the Supplier for support and assistance;\r\n4.7\tSome Rewards may differ slightly from the image shown on the Website and on the Mobile Application;\r\n4.8\tRewards (excluding Coupons) which are not claimed within six months after the date of redemption, will expire if the Member is not reachable;\r\n4.9\tRewards will be delivered directly by the Supplier within ten working days;\r\n4.10\tTo redeem his\/her BLU Points in-store at Program Partners’ locations, the Member must use his\/her PIN Code;\r\n5\tCOUPONS\r\n5.1\tCoupons are issued by BLU for use at the specified Supplier and for the specified Reward. They must be indicated at the time of purchase for the Reward to be delivered;\r\n5.2\tCoupons can only be used once and have a validity of 6 months and are not valid beyond the expiry date indicated on the Coupon. If the specific Reward is out of stock and Member decided not to take a replacement, the Coupon can be cancelled at any time within the 6 months validity period. If Member redeems Coupon for an item of higher value than the original specific Reward, Member may wish to pay the excess value in cash but acceptance will be up to the Program Partner’s discretion. On the other hand, if Coupons are redeemed against an item of lesser value than the original specific reward, no change will be given;\r\n5.3\tCoupons cannot be exchanged for cash, sold or transferred for value. They remain the property of BLU. The Rewards redeemed with Coupons are the responsibility of the rewards provider and not BLU;\r\n5.4\tFor Coupons cancellations and refunds please contact the local BLU Call Center during working hours or send BLU an email at info@blupoints.com. A cancellation fee of 2.5% in BLU Points equivalent of the total Coupon value or 300 BLU Points, whichever is greater will be applied. BLU Points will be credited back to the members account within 10 days following receipt of the cancellation fee and returned vouchers. For Coupons purchased with BLU Points that have subsequently expired, the expired BLU Points will be forfeited and not credited back to the members account;\r\n5.5\tFor lost Coupons, Member should contact the local BLU Call Center or send an email to info@blupoints.com. Coupons will be re-issued or refunded within 10 working days;\r\n6\tOTHER REDEMPTION TERMS\r\n6.1\tBLU and\/or Supplier are not responsible for the unauthorized use of Coupons. Supplier terms and conditions also apply on the use of Coupons or on the delivery of the Reward;\r\n6.2\tWe cannot be held liable for any loss, theft, damage or unauthorized use of a BLU Card, Member’s PIN Code, or Reward, whether in the course of delivery or otherwise. Any replacement of a BLU Card can be provided at the discretion of the Program Partner;\r\n6.3\tAll conditions and warranties, whether expressed or implied and whether arising under legislation or otherwise, as to the condition, suitability, quality, fitness or safety of any Reward supplied are expressly excluded to the full extent permitted by law. Any liability that cannot be fully excluded is limited, where permitted, to replacing, repairing or crediting the value of the Reward at our discretion;\r\n6.4\tA Member must enter his\/her personal PIN Code when conducting a redemption transaction in the BLU Points Program. Additional security questions might be asked by the Program Partner or a BLU staff. All Rewards redeemed on a BLU Account which are sent by post will be sent to the latest address we have for the Member or the address provided at the time of checkout;\r\n6.5\tIt is the Member’s responsibility to ensure the PIN Code is not compromised, shared with anyone, or mishandled. Any loss resulting from the unauthorized use of the Member’s PIN code is the Member’s responsibility alone;\r\n7\tOTHER GENERAL TERMS\r\n7.1\tBLU Points have a three-year expiry date. They will be lost if expired. Additionally, they will be lost if the relevant BLU Account is closed or the BLU Points Program ends. Where BLU Points are redeemed for a Coupon carrying a specified cash discount or benefit, the Coupon will have an expiry date specified on it and will be subject to any other terms and conditions stated on the Coupon or otherwise publicized;\r\n7.2\tRedeemed BLU Points cannot be used again. If a transaction on which BLU Points are issued or redeemed is cancelled, reversed or not completed, we will reverse the associated BLU Points movement when instructed by the relevant Program Partner or Supplier. If insufficient BLU Points are available, or we suspect fraud or misconduct, Rewards may be refused or cancelled;\r\n7.3\tOur Privacy Policy (which is part of these Member Terms) sets out the information that we will gather on Members and how a Member uses his\/her BLU Card or BLU Account and earns and redeems BLU Points, how this information will be used and whom it may be shared with. We will comply with our Privacy Statement – every Member should read it carefully;\r\n7.4\tBLU Cards are our property and must be returned to us on request or destroyed when no longer valid for use. The Member is responsible for the security of all BLU Cards issued on his\/her BLU Account and all Coupons issued on that account. If a BLU Card or a PIN code is lost or the holder thinks an unauthorized person has become aware of any security code, password or account number, they should contact the BLU Call Center immediately and\/or change the PIN through the Website or Mobile Application. Coupons should be treated like cash. We cannot be responsible for any unauthorized use of BLU Points or any lost or stolen Coupons;\r\n7.5\tWe may close any BLU Account on which no BLU Points have been earned or redeemed for a continuous period of at least 12 months. We may also, on notifying the Member, immediately suspend or terminate the rights of any Member and\/or close any relevant BLU Account, if they breach these Member Terms, if we reasonably believe that they have dealt with BLU Points in a manner not permitted by these Member Terms or any applicable Program Partner's terms and conditions, if there is any theft from or misconduct in connection with us, any Program Partner or Supplier, if they supply false or misleading information to us or if they are abusive or offensive to any member of our staff. A Member can close his\/her BLU Account at any time by notifying us. If a BLU Account is closed Member’s rights to redeem BLU Points from that BLU Account are lost;\r\n7.6\tWe may make changes to these Member Terms and will give the Member as much notice as we reasonably can. Earning or redeeming BLU Points on a BLU Account will constitute acceptance of the revised Member Terms. We may suspend or terminate the BLU Points Program but will give as much notice as we reasonably can before we do so. If this happens all BLU Accounts will be suspended or terminated. If we sell or transfer BLU to another company we may transfer all of our rights and obligations under these Member Terms without any further consent and may disclose or transfer all information we hold about Members to a prospective or actual new owner. Such a disclosure or transfer will not alter the rights of such Members in respect of the use that can be made of such information by such other company;\r\n7.7\tWe will only be liable to a Member who suffers loss as a result of our breach of these Member Terms and, if so, our sole liability will be to credit to the relevant BLU Account any BLU Points which have been wrongly deducted or should have been credited but were not. These Member Terms prevail in the event of any conflict or inconsistency with any other communications, including advertising or promotional materials;\r\n7.8\tMember can contact us by calling the BLU Call Center or sending us an email to info@blupoints.com. We may record calls to check the quality of our services or for training, audit or security purposes;\r\n8\tWEBSITE AND MOBILE APPLICATION TERMS OF USE\r\n8.1\tThe Website and Mobile Application Terms of Use shall set out the legal conditions related to the Member’s use of and access to the Website and Mobile Application. By checking any acceptance boxes, clicking any acceptance buttons, submitting any text or content or simply by making any use of the Website and Mobile Application, Member (a) accepts these terms and agrees to be bound by each of them, and (b) represents and warrants to BLU that (i) Member is at least 13 years of age and have the authority to accept these terms (either on Member’s own behalf or by having a parent or legal guardian agree to the terms set forth herein on Member’s behalf), (ii) these terms are binding and enforceable against Member, (iii) to the extent an individual is accepting these terms on behalf of an entity, such individual has the right and authority to agree to all of the terms set forth herein on behalf of such entity, and (iv) Member has read and understood BLU's Privacy Policy;\r\n8.2\tThe purpose of the Website and Mobile Application Terms of Use is to set forth the terms and conditions under which, among other things, (i) BLU will license to the Member the use of certain of BLU's technology, software and\/or services such that Member can utilize the website and Mobile Application through Member’s mobile device, and (ii) Member can access and\/or use the Website. As stipulated elsewhere herein, BLU does not exert any control over any Program Partner and Supplier, and as such is not liable or responsible for any actions taken or omitted to be taken by any such third party;\r\n8.3\tBLU hereby grants Member a non-transferable, non-exclusive, revocable, limited license to access and use BLU's Website and Mobile Application solely for the purpose outlined before. BLU may, from time to time, update or modify the Website and Mobile Application, release new versions of the Website and Mobile Application or create new modules related thereto, each of which may, at BLU's discretion, be included within the license described above. Member shall not be permitted to sublicense or transfer any of Member’s rights hereunder including, without limitation, access to the Website and Mobile Application;\r\n8.4\tMember shall not directly or indirectly copy or reproduce all or any part of the Website and Mobile Application or the Website, whether electronically, mechanically or otherwise, in any form including, but not limited to, the copying of presentation, style or organization. Member shall use the Website and Mobile Application solely for its intended purposes and shall not use the Website and Mobile Application for the benefit of any third party except as specifically contemplated under this Agreement. Member shall not use the Website and Mobile Application to post, transmit, convey, submit, distribute, store or destroy any content, photographs, descriptions, drawings, content, audio materials, text, messages or other information (collectively, \"Posted Information\"): (a) in violation of any applicable law, statute, ordinance or regulation; (b) in a manner that will infringe the intellectual property rights of others; (c) that is defamatory, obscene or trade libelous; (d) that contains any viruses, Trojan horses, worms, time bombs, cancel bots or other computer programming routines that are intended to damage, detrimentally interfere with, surreptitiously intercept or expropriate any system, data or personal information; (e) that is false, misleading or inaccurate in any way; or (f) in violation of the any acceptable use policy or other policy posted at the Website or within the Website and Mobile Application from time to time. Member shall not violate or attempt to violate the security of the Website and Mobile Application. Member shall not reverse engineer, decompile, disassemble or otherwise attempt to derive source code or other trade secrets from the Website and Mobile Application, including, without limitation, any of the software comprising or in any way making up a part of the Website and Mobile Application. In addition, Member will not export, re-export or permit any third party to export or re-export, directly or indirectly, the Website and Mobile Application where such export or re-export is prohibited by applicable law without appropriate licenses and clearances. Member shall defend and indemnify BLU, at Member’s sole cost and expense, from and against any claims, damages, liabilities and\/or expenses arising out of Member’s breach of any of Member’s obligations or representations set forth in this section;\r\n8.5\tMember shall be solely responsible for: (i) all Posted Information Member input into the Website and Mobile Application; (ii) ensuring that all Posted Information is appropriate in tone and is accurate; (iii) complying with all applicable laws, rules and regulations at all times; and (iv) maintaining all passwords and access codes to the Website and Mobile Application, and refraining from sharing or otherwise permitting third parties to use any such passwords and\/or access codes to access the Website and Mobile Application;\r\n8.6\tBLU shall be entitled, at its sole discretion, to suspend, restrict and\/or terminate, without notice of any kind, Member’s access to the Website and Mobile Application or Member’s BLU account for any reason. Notwithstanding the foregoing, BLU shall not be required to review or monitor any Posted Information entered into the Website and Mobile Application or otherwise submitted by Member, and Member shall be solely responsible for the veracity and accuracy of all such data, content and information;\r\n8.7\tBLU does not currently charge its Members to access and use the Website and Mobile Application, however BLU may, at any point and in its discretion, elect to begin charging fees for use of various portions of the Website and Mobile Application and\/or for different levels of subscription or account;\r\n8.8\tAccess to the Website and Mobile Application will end if (i) Member and\/or BLU provide written or electronic notice of termination (at which point Member shall no longer be entitled to access or use the Website and Mobile Application), or (ii) BLU elects to terminate Member’s access to the Website and Mobile Application, with or without notice. For purposes of clarity, Member is entitled to terminate Member’s BLU account at any time. Upon termination of the BLU Account for any reason, Member shall no longer be entitled to access or use the Website and Mobile Application or any other non-public portions of the Website. In addition to the foregoing, in the event that BLU determines, in its sole and absolute discretion, that Member have breached the Member Terms, threatened to breach the Member Terms, committed any fraud or deception, breached any BLU policy in effect from time to time or otherwise failed to perform to the standards required of BLU, BLU shall be entitled, at its discretion and in addition to any other remedies it may have hereunder and\/or at law, to terminate, cancel or suspend Member’s access to the Website and Mobile Application, in each of the foregoing cases at any time and for any period of time. BLU shall not be responsible for the return of any Posted Information of any kind to Member upon any termination of this Agreement or suspension of Member’s access to the Website and Mobile Application, including without limitation any information input into the Website and Mobile Application by Member;\r\n8.9\tAll trademarks, patents, copyrights and other intellectual property rights owned by BLU and\/or the Member on the date hereof shall continue to be owned solely by each of them, and except as set forth herein, nothing in these Member Terms shall be deemed to confer any rights to any such intellectual property on the other. For purposes of clarity: (i) as between Member and BLU, Member shall be deemed to be the sole owner of all Posted Information entered into the Website and Mobile Application or otherwise posted by Member; and (ii) BLU is the sole owner of the name \"BLU\" as well as the Website, the Website and Mobile Application, and all source code, object code, software, content, copyrights, trademarks, patents and other intellectual property related thereto or included therein. All suggestions, recommendations, bug-fixes, error-fixes or other communications from Member to BLU regarding the Website and Mobile Application or the Website shall, upon submission to BLU, be owned solely and exclusively by BLU. In addition, BLU shall be entitled to post feedback at the Website and within the Website and Mobile Application (and\/or allows others to do so), both positive and negative, regarding any Member. Member acknowledges and agrees that the applicable supplier(s) of any third party software included within the Website and Mobile Application shall own all worldwide rights, title and interest in and to such third party software (and any intellectual property rights therein), subject to such suppliers' license, if any, of such third party software to BLU;\r\n8.10\tIn exchange for Member’s use of the Website and\/or the Website and Mobile Application, Member hereby grants to BLU an unlimited, perpetual, irrevocable, fully-paid, transferable, assignable, sub-licensable, worldwide license to use, reproduce, modify, publish, edit, translate, distribute, commercially exploit, repurpose, perform and display any and all Posted Information Member posts to the Website, submits to BLU or post through the Website and Mobile Application, alone or as part of other works in any form, media or technology whether now known or hereafter developed, and to sublicense such rights through multiple tiers of sublicensees, in connection with BLU performing the services described herein. Finally, Member irrevocably waives, and cause to be waived, against BLU and its Members any claims and assertions of moral rights or attribution with respect to Member’s Posted Information. BLU shall be entitled to display advertising and\/or any other content at locations of its choosing within the Website and\/or Website and Mobile Application, including without limitation adjacent to Member’s Posted Information;\r\n8.11\tMember agrees to treat as confidential all confidential information of BLU, not to use such confidential information for any purpose other than to the limited extent necessary to use the Website and Mobile Application and not to disclose such confidential information to any third party except as may be reasonably required pursuant to these Member Terms and subject to confidentiality obligations at least as protective as those set forth herein. Without limiting the generality of the foregoing, Member shall use at least the same degree of care which Member uses to prevent the disclosure of Member’s own confidential information of like importance to prevent the disclosure of confidential information disclosed by BLU, provided, however, that in no event shall such degree of care be less than reasonable in light of general industry practice. In addition;\r\n8.12\tExcept as explicitly set forth herein, neither BLU, its affiliates or any of any such party's equity holders, directors, officers, employees, agents, suppliers, licensors nor the like, makes any warranties of any kind, either expressed or implied, including, without limitation, (a) warranties of merchantability or fitness for a particular purpose, (b) that the Website or the Website and Mobile Application will be error-free, (c) as to a minimum level of uptime for the Website and Mobile Application or the Website, or (d) as to the results that may be obtained by Member by accepting these Member Terms and\/or using the Website and Mobile Application. Member agrees and acknowledges that the Website and Mobile Application and Website are licensed and\/or provided hereunder on an \"as is\" basis. In addition, Member hereby agrees and acknowledges that: (i) BLU shall not be responsible for any actions taken by any other party using the Website and Mobile Application or reviewing any of Member’s Posted Information; (ii) BLU does not recommend or endorse any third parties hereunder, and makes no representations or warranties whatsoever regarding any such third party; (iii) BLU is not a party to any transaction between Member and any Program Partner, Supplier, or business with which BLU has a business relationship, and as such, any disputes regarding purchases, rewards and\/or any other aspect of any transaction or other commercial dealings is solely between Member and such third party; (iv) BLU is not responsible for any other party's compliance with applicable laws, rules or regulations; (v) BLU shall not, under any set of circumstances, be responsible or liable for an content, text, photographs and\/or other Posted Information, including any Posted Information which may violate applicable law and\/or a third party's intellectual property rights; and (vii) the Website and Mobile Application and\/or Website may not function properly or as intended at times;\r\n8.13\tMember is responsible, at Member’s sole cost and expense, for providing all equipment necessary to access the Internet, the Website and\/or the Website and Mobile Application. While it is BLU's objective to make the Website and Website and Mobile Application accessible at all times, the Website and\/or Website and Mobile Application may be unavailable from time to time for any reason including, without limitation, routine maintenance. In addition, various portions of the Website or Website and Mobile Application may operate slowly from time to time. Member understands and acknowledges that due to circumstances both within and outside the control of BLU, access to the Website and\/or the Website and Mobile Application may be interrupted, suspended or terminated from time to time. In particular, and not in limitation of the foregoing, BLU shall not be liable in any way for any delay in responding to an inquiry or question forwarded by Member or the effects any delay or unavailability may have on Member. MEMBER AGREES THAT BLU SHALL NOT BE LIABLE FOR ANY DAMAGES ARISING FROM ANY SUCH INTERRUPTION, SUSPENSION OR TERMINATION OF THE WEBSITE AND\/OR WEBSITE AND MOBILE APPLICATION AND THAT MEMBER SHALL PUT IN PLACE CONTINGENCY PLANS TO ACCOUNT FOR SUCH PERIODIC INTERRUPTIONS OR SUSPENSIONS OF THE WEBSITE AND\/OR WEBSITE AND MOBILE APPLICATION.\r\n8.14\tBLU SHALL NOT, UNDER ANY SET OF CIRCUMSTANCES, BE LIABLE TO MEMBER FOR ANY SPECIAL, INCIDENTAL, INDIRECT, PUNITIVE OR CONSEQUENTIAL DAMAGES, INCLUDING, BUT NOT LIMITED TO, LOST PROFITS OR DATA, ARISING OUT OF ACCEPTING THESE TERMS OR MEMBER’S USE OF THE WEBSITE AND MOBILE APPLICATION OR WEBSITE, WHETHER BASED IN CONTRACT, TORT OR ANY OTHER LEGAL THEORY, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGES. IN ANY EVENT, BLU'S TOTAL LIABILITY TO MEMBER FOR ANY CLAIM ARISING HEREUNDER OR RELATED HERETO SHALL NOT EXCEED USD50.00.\r\n8.15\tBLU shall not be liable to Member for failure or delay in performing any obligations hereunder if such failure or delay is due to circumstances beyond its reasonable control.\r\n8.16\tThe following terms and conditions govern general use of the Website:\r\n8.16.1\t(a) Member agrees to abide by all restrictions displayed on the Website and\/or within the Website and Mobile Application, as and when they are updated from time to time. BLU reserves the right to remove any content Member post to the Website or within the Website and Mobile Application, block the sending of any inquiry or other content BLU deems inappropriate in its sole discretion, and may terminate all access to the Website and\/or Website and Mobile Application at any time in its sole discretion for any or no reason. While BLU reserves the right to monitor all postings and\/or content posted at the Website and\/or within the Website and Mobile Application, it has no obligation to do so;\r\n8.16.2\tPermitted Uses. Member may use the Website only in good faith for the purposes described herein. Member may download and print out portions of the content from the Website for non-commercial purposes provided that Member follows the rules in this Agreement. Member may not use the Website or Website and Mobile Application, or any business listings, contract information or other content, to promote another business or commercial venture.\r\n8.16.3\tDistribution. Except as expressly permitted under other provisions of this Agreement, Member may not modify, reproduce, duplicate, copy, photocopy, print, republish, display, translate, transmit, distribute, sell, resell, rent, lease, loan, exploit, reduce to any electronic medium or machine-readable form, or otherwise make available in any form or by any means all or any portion of the Website, the content or any information or materials retrieved from either of them, including, without limitation, graphics and logos, in whole or in part, for any purpose;\r\n8.16.4\tDerivative Works. Member may not create compilations or derivative works of the Website or the Website and Mobile Application, the Website or Website and Mobile Application content or any other materials from the Website or Website and Mobile Application;\r\n8.16.5\tProprietary Notices. Member may not remove, change or obscure and Member must retain on all copies of the content Member download any copyright notice or other proprietary notice, Privacy Policy, legal disclosures or terms of use contained in the content or on the Website;\r\n8.16.6\tInfringement. Member may not use the Website, Website and Mobile Application, the Website and\/or Website and Mobile Application content or any other materials from the Website or Website and Mobile Application in any manner that may infringe upon any copyright or other intellectual property right, proprietary right, or property right of BLU or any third party;\r\n8.16.7\tInformation Distribution. Member may not use the Website and\/or Website and Mobile Application or any communications service, chat room, message board, blog, forum, newsgroup, or other interactive service that may be available to Member on or through the Website or Website and Mobile Application to transmit, upload, post, distribute or facilitate distribution of, or otherwise make available any information or content, including text, communications, software, images, sounds, data or other information, that:\r\n8.16.7.1\tIs false;\r\n8.16.7.2\tContains explicit or graphic descriptions or accounts of sexual acts, including, without limitation, sexual language of a violent or threatening nature directed at another individual or group of individuals;\r\n8.16.7.3\tIncludes any inside information and\/or proprietary or confidential information learned or disclosed under nondisclosure agreements;\r\n8.16.7.4\tMember is restricted from using under any law;\r\n8.16.7.5\tInfringes upon the intellectual property rights of any third party; or\r\n8.16.7.6\tContains software viruses or any other computer code, files or programs that are designed or intended to disrupt, damage, or limit the functions of any software, hardware, or telecommunications equipment or to damage or obtain unauthorized access to any data or other information of any other party;\r\n8.17\tOther Prohibited Uses. Member may not use the Website or Website and Mobile Application for any purpose that:\r\n8.17.1\tIs unlawful, threatening, abusive, harassing, defamatory, libelous, deceptive, fraudulent, invasive of another's privacy, tortious, or otherwise violates BLU's rules or policies;\r\n8.17.2\tVictimizes, harasses, degrades, or intimidates an individual or group of individuals on the basis of religion, gender, sexual orientation, race, ethnicity, age, disability, or any other classification protected by law;\r\n8.17.3\tInvades any person's or entity's privacy or other rights;\r\n8.17.4\tConstitutes unauthorized or unsolicited advertising, junk or bulk e-mail (also known as \"spamming\"), chain letters, any other form of unauthorized solicitation, or any form of lottery or gambling;\r\n8.17.5\tMisidentifies Member or impersonates any person or entity, including, without limitation, any employee or representative of BLU, or falsely states, implies, or otherwise misrepresents Member’s affiliation with a person or entity by, for example, pretending to be someone other than Member or pretending to represent a company or organization that Member are not affiliated with or authorized to represent; or\r\n8.17.6\tCould otherwise reasonably be deemed or viewed to be unethical, illegal or offensive;\r\n8.18\tOthers' Personal Information. Member may not knowingly solicit or collect personal information from a child 13 years old younger without appropriate prior verifiable parental consent;\r\n8.19\tHarm to Minors. Member may not take any action on the Website or within the Website and Mobile Application or use the Website and\/or Website and Mobile Application content to harm minors in any way;\r\n8.20\tSolicitation. Member may not use the Website or Website and Mobile Application or any Website or Website and Mobile Application content in a manner that violates any national or international law regulating commercial e-mail, facsimile transmissions or telephone solicitations;\r\n8.21\tThe Website, the Website and Mobile Application and the Website and Website and Mobile Application content may contain and\/or provide access to content provided by third parties, including, without limitation, information, dialogue, opinions, stories, advice, statistical data, text, software, music, sound, photographs, graphics, video, messages, and other materials, whether publicly or privately posted to or e-mailed or otherwise transmitted through the Website or Website and Mobile Application (\"Third Party Content\") that may include content Member find to be offensive, indecent or objectionable. The third party from whom or which any such Third Party Content originates is solely responsible for it and BLU assumes no responsibility to verify, has no control or influence over, makes no representations regarding, and does not guarantee the accuracy, integrity or quality of any Third Party Content. Accordingly, BLU has no liability of any kind to Member or any other person relating to any Third Party Content, including, without limitation, mistake, misstatement of law, omission, falsehood, defamation, obscenity, pornography, profanity, opinion, representation and any other content contained in the Third Party Content or for any loss or damage of any kind incurred as a result of the use of any Third Party Content. Statements of opinion and commentary in Third Party Content are those of the third party and, unless BLU expressly states in writing to the contrary, BLU neither endorses nor adopts as its belief any such statements. BLU may provide information in articles BLU posts or links to through the Website only for educational and general informational purposes and not as professional advice. BLU has made no attempt to verify any information contained in any such articles;\r\n8.22 As a convenience to Member and other Website visitors, the Website may contain links to websites that are owned and operated by third parties that are not affiliated with BLU. When Member uses these links, Member will leave the Website and BLU will have no ability to protect Member’s interests. Member visits linked websites at Member’s own risk and it is Member’s responsibility to take any protective measures to guard against viruses and other destructive elements. BLU is not responsible for and, unless it expressly states otherwise in writing, makes no warranty or representation regarding and does not endorse any linked website or any service, product or information provided on or through the linked website;\r\n8.23\tBLU respects the intellectual property of others, and asks Member and all users to do the same. Material available on or through other websites may be protected by copyright and the intellectual property laws of different countries, and the terms of use of those websites, and not these Member Terms, govern Member’s use of that material. It is BLU's policy, in appropriate circumstances and at its discretion, to disable and\/or terminate the accounts of users who may infringe or repeatedly infringe the copyrights or other intellectual property rights of BLU and\/or others;\r\n8.24 BLU will not trade with or provide any services to individuals and companies owned or controlled by, or acting for or on behalf of, OFAC targeted countries AND individuals, groups, and entities, such as terrorists and narcotics traffickers designated under the OFAC programs that are not country-specific;\r\n8.25\tAny controversy of claim arising out of or relating to these Member Terms shall be governed and construed in accordance with the laws of the United Arab Emirates (UAE) ;\r\n9\tREFUND POLICY\r\n9.1 BLU accepts payment by Visa or Mastercard debit and credit cards in multiple currency for its products and services. All online purchases are also governed by the terms and conditions of respective supplier service providers. Please review respective supplier service provider’s user agreement and privacy policy before entering any transaction. All refunds will be made onto the original mode of payment. The displayed price and currency selected by Member, will be the same price and currency charged to the Card and printed on the Transaction Receipt."},{"key":"mob_privacyPolicy_ViewTitle","value":"الخصوصية"},{"key":"mob_privacyPolicy_PrivacyPolicy","value":"The BLU Points Loyalty (“Program”) is conscious of the nature of the information in its reach and endeavors to maintain confidentiality and privacy of this information as stipulated thereafter. This Privacy Policy aims to govern the manner by which information is either voluntarily or involuntarily collected. In addition to how the information is used, disclosed, maintained, and collected from all users (“Users”) in the course of the Program’s business under its parent company, affiliates, subsidiaries, partners and franchisees, information can be collected anytime Users interact within the Program such as when Users visit or access or browse the website, call or email the call centers, use mobile applications, use mobile websites, or use the products and services through our Program Partners.\r\n\r\n\r\nUsers include:\r\n\r\nMembers are individuals and customers of our Program Partners or independent members who have applied to join the BLU Points Program.\r\n\r\nProgram Partners are companies or entities which provide products and services to Members and have opted to be part of the BLU Points Program under agreement.\r\n\r\n\r\n1 PURPOSE OF INFORMATION COLLECTED\r\n\r\n\r\nThe BLU Points Program offers Users the opportunity to issue, earn and redeem rewards using its loyalty network. In this process the Program will collect information on Users for the purpose of:\r\n\r\n•Administering the Network\r\n\r\n•Managing User’s accounts, to accurately record and update Points balances\r\n\r\n•Recording and Processing User’s issuance and redemption of BLU Points\r\n\r\n•Communicating product and service information, events, news and offers to Members\r\n\r\n•Understanding Members’ needs, desires, and shopping preferences\r\n\r\n•Analyzing Members’ preferences, needs, and behavioral patterns\r\n\r\n•Marketing of products and services that interest Users\r\n\r\n•Developing and enhancing products and services to meet User’s preferences and needs\r\n\r\n•Engaging and participating of User’s in promotions, offers, draws, events, and surveys\r\n\r\n•Improving Users overall experience and service, and responding to Users’ requests and needs.\r\n\r\n\r\n2 COOKIES POLICY\r\n\r\n\r\nThe Program may automatically receive and store certain types of information whenever Users interact with the Program. The most common sources of this information include cookies, web beacons, pixel tags or clear Graphics Interchange Format files, known as GIFs. Examples of such information include User’s browser type, the type of operating system, the name of Internet service provider, pages visited on the Program. Users have the ability to accept or decline cookies. Most Web browsers accept cookies by default, though Users can usually modify their browser setting to decline cookies as a matter of preference. If Users choose to decline cookies, they may not be able to sign in or use other interactive features of the Program site and services that depend on cookies.\r\n\r\n\r\n3 BROADCAST POLICY\r\n\r\n\r\nBy providing information in the process of joining the Program, through direct listing or enrollment by Program Partners, Members automatically and irrevocably agree to receive short message services (“SMS”), emails, multimedia, newsletters, notifications, images, clippings, or other various types of broadcast.\r\n\r\n\r\n4 YOUR CONSENT TO THE PROGRAM’S PRIVACY POLICY\r\n\r\n\r\nUsers acknowledge, consent and agree to this Privacy Policy to receive and benefit from the BLU Points Loyalty Program.\r\n\r\n\r\n5 USE AND DISCLOSURE OF INFORMATION\r\n\r\n\r\nExcept as otherwise stated below, the Program does not sell, trade or rent Users’ personally identifiable information collected to others. The information collected by the Program is used to process orders, to keep Users informed about their order status, to notify Users of products or special offers that may be of interest to them, and for statistical purposes to improve the Program. The Program will disclose Users’ personally identifiable information to third parties for order tracking purposes or process Users’ check or money order, as appropriate, fill Users’ order, improve its functionality, perform statistical and data analysis, deliver Users’ order and deliver promotional emails to Users. For example, the Program must release Users’ mailing address information to the delivery service to deliver products that Users ordered. All credit\/debit cards’ details and personally identifiable information will NOT be stored, sold, shared, rented or leased to any third parties.\r\n\r\n\r\nThe Program may use non-personal \"aggregated data\" to enhance its operation or analyze interest in its areas. Moreover, the Program may in some circumstances disclose personally identifiable information to third parties to enhance Users’ experience. Additionally, if Users provide the Program with content for publishing or feedback, the Program may publish Users’ username or other identifying data with Users’ permission.\r\n\r\n\r\nThe Program may also disclose personally identifiable information in order to respond to a subpoena, court order or other such request. The Program may also provide such personally identifiable information in response to a law enforcement agencies request or as otherwise required by law. Users’ personally identifiable information may be provided to a party if the Program files for bankruptcy, or there is a transfer of the assets or ownership of the Program in connection with proposed or consummated corporate reorganizations, such as mergers or acquisitions.\r\n\r\n\r\n6 PROGRAM PARTNER AND OTHER WEBSITES PRIVACY WAIVER\r\n\r\n\r\nProgram Partners may have access to transactional data in terms of products and services purchased, which they may utilize and analyze. The Program is not responsible or liable for information collected by the Program Partners.\r\n\r\n\r\n7 SECURIY\r\n\r\n\r\nThe Program takes appropriate steps to ensure data privacy and security including through various hardware and software methodologies. However, the Program cannot guarantee the security of any information that is disclosed online.\r\n\r\n\r\n8 MINORS\r\n\r\n\r\nThe Program does not knowingly collect personal information from minors under the age of 13. Minors are not permitted to use the Program’s website or services, and the Program requests minors under the age of 13 not to submit any personal information to the website. Since information regarding minors under the age of 13 is not collected, the Program does not knowingly distribute personal information regarding minors under the age of 13.\r\n\r\n\r\n9 CORRECTIONS AND UPDATES\r\n\r\n\r\nIf Users wish to modify or update any information the Program has received, please contact info@blupoints.com.\r\n\r\n\r\n10 PRIVACY POLICY MODIFICATIONS AND UPDATES\r\n\r\n\r\nThe Program may from time to time or as it deems necessary change, amend and update it Privacy Policy and Terms & Conditions. Therefore Users are encouraged to frequently visit these sections in order to be updated about the changes on the Program’s website at www.blupoints.com. Modifications will be effective on the day they are posted.\r\n\r\n\r\nThe Privacy Policy may also be amended as required by law in specific countries and jurisdictions."},{"key":"mob_faq_ViewTitle","value":"الأسئلة المتكررة"},{"key":"mob_faq_FAQ","value":"MEMBERS\r\n\r\n\r\n1\tHow do I enroll and become a Member in the BLU Points Program?\r\n\r\n\r\nYou can enroll by registering at any BLU participating merchant location – i.e. BLU Partner – or directly online through the BLU website at blupoints.com or through the BLU Mobile App.\r\n\r\n2\tWhen and how can I start earning BLU Points?\r\n\r\n\r\nYou can start earning BLU Points as soon as you register. From that point on inclusively you will be credited BLU Points every time you make a purchase at any BLU Partner location. Just make sure to remind the cashier at the checkout counter that you are a BLU Member!\r\n\r\n3\tWhy is the number of BLU Points I earned relative to the money I spent different at times?\r\n\r\n\r\nThe number of points earned relative to the purchase amount will vary from one BLU Partner to another. Some BLU Partners may change the rate of rewarding of points from time to time and without prior notice. Also, the same BLU Partner might choose to reward their clients with more BLU Points for purchasing certain items, or shopping at certain locations. We advise checking directly with each BLU Partner for the details on how they give out BLU Points.\r\n\r\n\r\n4\tCan I earn BLU Points even if I don’t have my BLU Loyalty card with me?\r\n\r\n\r\nYes, you can claim BLU Points even if you don’t happen to carry your BLU Loyalty Card with you. You can earn BLU Points by either:-\tusing your registered mobile number-\tproviding your BLU Loyalty card number-\tpresenting an image of the barcode of your BLU card.\r\n\r\n\r\n5\tDo I get charged for enrolling in the BLU Points Program?\r\n\r\n\r\nNo, Membership in the BLU Points Program is FREE of charge.\r\n\r\n\r\n6\tWhen and how can I start redeeming my points?\r\n\r\n\r\nYou can start redeeming your BLU Points once your account is activated. You can redeem your BLU Points for any item at a BLU Partner location. You can also exchange your BLU Points for any item on the BLU Catalog available on blupoints.com or through the BLU Mobile App. To complete a redemption transaction you will need to enter your PIN Code when prompted.\r\n\r\n\r\n7\tHow do I receive my PIN Code?\r\n\r\n\r\nYou will receive your PIN code via SMS the first time you register. Your new PIN Code is sent directly to your mobile number registered under your account. If subsequently you request a new PIN, it will also be sent to the mobile number on file. For this reason, please make sure that the mobile number registered under your account is correct and up to date at all times.\r\n\r\n\r\n8\tHow do I activate my account?\r\n\r\n\r\nActivating your account is really easy. Log into your account online at blupoints.com or on the BLU Mobile App, press the ACTIVATE MY ACCOUNT button and then enter your PIN code. You can also activate your account by using your PIN to complete a redemption transaction at any BLU Partner location.\r\n\r\n\r\n9\tCan I cancel my membership at any time?\r\n\r\n\r\nYes, you can choose to cancel your membership account at any time by logging into your account on blupoints.com or on the BLU Mobile App using your registered email address or mobile number and PIN.\r\n\r\n\r\n10\tCan I have other family members become Members of the BLU Points Program?\r\n\r\n\r\nYes, family and friends can enroll in the BLU Points Program, as long as they are 13 years of age and above.\r\n\r\n\r\n11\tHow can I check my BLU Points balance?\r\n\r\n\r\nYou can check your BLU Points balance statement by logging into your account on blupoints.com or through the BLU Mobile App.\r\n\r\n\r\n12\tCan I update my profile and personal details?\r\n\r\n\r\nYes, you can update your profile and personal details by logging into your account on blupoints.com or through the BLU Mobile App. Once logged in, you can manage all your profile information, preferences and contact details. Members are encouraged to keep their profile information up to date to better benefit from the vast variety of rewards.\r\n\r\n\r\n13\tWhat happens if I lose or forget my PIN Code?\r\n\r\n\r\nYou can request BLU to generate a new PIN online on blupoints.com or through the BLU Mobile App. Alternatively, you can request a new PIN when completing a redemption transaction at any BLU Partner location.\r\n\r\n\r\n14\tHow can I change my registered mobile number?\r\n\r\n\r\nYou can log into your account on blupoints.com or through the BLU Mobile App and make changes to your mobile phone number registered under your account, as well as other profile information and contact details.\r\n\r\n\r\n15\tFor how long are my BLU Points valid?\r\n\r\n\r\nYour BLU Points are valid for up to 3 years from the time they are credited to your account.\r\n\r\n\r\n16\tCan I transfer my BLU Points to another Member?\r\n\r\n\r\nYes, you can transfer your BLU Points, entirely or partially, to any other Member within the BLU Program.\r\n\r\n\r\n17\tDo I pay any fees for the transfer of BLU Points?\r\n\r\n\r\nYes, you will be charged a transfer fee equivalent to 5% of the amount of the points transferred or 100 (one hundred) BLU points, whichever is greater.\r\n\r\n\r\n18\tCan I earn and redeem BLU Points when I travel abroad?\r\n\r\n\r\nYou can earn and redeem BLU Points anywhere and anytime within the BLU network from any BLU Partner globally.\r\n\r\n\r\n19\tHow can I accelerate my earnings of BLU Points?\r\n\r\n\r\nTo get the maximum number of BLU Points, ensure you claim them every time you make a purchase from a BLU Partner. Also, keep an eye on special offers and promotions. BLU Partners may reward you extra BLU Points for various things, such as purchasing specific items, shopping at a specified branch, entering a store at a particular time, and so on…\r\n\r\n\r\n20\tIf I pay with a credit card issued by a BLU participating bank, would I earn more BLU Points?\r\n\r\n\r\nYes, if you are making a payment at a BLU Partner’s store and you are using a credit or debit card issued by a participating bank, you would be rewarded BLU Points by both the BLU Partner and the participating bank.\r\n\r\n\r\n21\tHow can I know who the BLU Partners are?\r\n\r\n\r\nYou can visit blupoints.com or your BLU Mobile App on a regular basis to see the updated list of BLU Partners. All stores displaying the BLU logo on the door or on the checkout counter are part of the BLU network.\r\n\r\n\r\n22\tHow do I know that I have been rewarded BLU Points upon a purchase from a BLU Partner?\r\n\r\n\r\nUpon your purchase some BLU Partners will send you an SMS notifying you of the BLU Points earned from that transaction and your new balance. However, as this is not practiced by all BLU Partners, it is advisable for you to regularly check your BLU Points balance on blupoints.com or through the BLU Mobile App.\r\n\r\n\r\n23\tIf BLU Points have not been credited to my account, what should I do?\r\n\r\n\r\nIt is a good practice to check your balance online and to keep track of the SMS notifications received from BLU Partners. In case you believe your earned BLU Points have not been credited properly to your account, you should first contact the BLU Partner where the transaction took place to clarify or adjust the inconsistency. If that does not resolve the issue, you can contact BLU directly at info@blupoints.com. Keep in mind that with some BLU Partners and participating banks, the crediting of the BLU Points is not immediate, and will take place at the end of your billing cycle (i.e. at the end of the month, or when you receive your billing statement).\r\n\r\n\r\n24\tI am not able to find the BLU Mobile App online – where is it?\r\n\r\n\r\nThe BLU Mobile App is shortly on its way. BLU will notify its Members when the BLU Mobile App will become available online for download.\r\n\r\n25\tHow can I get help if I have questions that I cannot find in this FAQ?\r\n\r\n\r\nYou are welcome to contact our customer care at info@blupoints.com who would gladly assist you with any query you may have. Please allow 24 to 48 hours for a response."},{"key":"mob_contactUs_ViewTitle","value":"الاتصال بنا"},{"key":"mob_contactUs_Info","value":"يرجى الاتصال بنا على عنوان البريد الإلكتروني التالي :"},{"key":"mob_bluPartners_ViewTitle","value":"شركاء"},{"key":"mob_spendPoints_ViewTitle","value":"استخدام النقاط"},{"key":"mob_spendPointsDetail_ViewTitle","value":"استخدام النقاط"},{"key":"mob_spendPointsDetail_FilterByCategory","value":"ترتيب حسب الفئة"},{"key":"mob_spendPointsDetail_Search","value":"بحث"},{"key":"mob_spendPointsProduct_ViewTitle","value":"المنتج"},{"key":"mob_flights_ViewTitle","value":"السفر مع BLU"},{"key":"mob_flights_FromPlaceholder","value":"من البلد أو المدينة أو المطار"},{"key":"mob_flights_ToPlaceholder","value":"إلى البلد أو المدينة أو المطار"},{"key":"mob_flights_ReturnFlight","value":"رحلة العودة"},{"key":"mob_flights_DepartureDate","value":"تاريخ المغادرة"},{"key":"mob_flights_ReturnDate","value":"تاريخ العودة"},{"key":"mob_flights_CabinClass","value":"درجة المقعد"},{"key":"mob_flights_Search","value":"بحث"},{"key":"mob_flightResults_ViewTitle","value":"نتائج البحث"},{"key":"mob_flightResults_Airlines","value":"شركة الطيران"},{"key":"mob_flightResults_Outbound ","value":"المغادرة"},{"key":"mob_flightResults_Inbound","value":"العودة"},{"key":"mob_flightDetails_ViewTitle","value":"تفاصيل الرحلة"},{"key":"mob_flightDetails_Outbound","value":"المغادرة"},{"key":"mob_flightDetails_Inbound","value":"العودة"},{"key":"mob_flightDetails_Book","value":"حجز"},{"key":"mob_flightDeliveryAddress_ViewTitle","value":"التفاصيل الشخصية"},{"key":"mob_flightDeliveryAddress_Title","value":"أدخل تفاصيلك الشخصية"},{"key":"mob_flightDeliveryAddress_Confirm","value":"تأكيد"},{"key":"mob_flightBookingSummary_ViewTitle","value":"ملخص تفاصيل الحجز"},{"key":"mob_flightBookingSummary_PersonalDetails","value":"التفاصيل الشخصية"},{"key":"mob_flightBookingSummary_FlightDetails","value":"تفاصيل الرحلة"},{"key":"mob_flightBookingSummary_Total","value":"المجموع"},{"key":"mob_flightBookingSummary_Proceed","value":"واصل"},{"key":"mob_hotels_ViewTitle","value":"السفر مع BLU"},{"key":"mob_hotels_CityPlaceholder","value":"المدينة أو الموقع"},{"key":"mob_hotels_CheckInDate","value":"الوصول"},{"key":"mob_hotels_CheckOutDate","value":"المغادرة"},{"key":"mob_hotels_Search","value":"بحث"},{"key":"mob_hotelsResults_ViewTitle","value":"نتائج البحث"},{"key":"mob_hotelsResults_AvgNight","value":"معدل\/ الليلة"},{"key":"mob_hotelsResults_Spend","value":"اصرف"},{"key":"mob_hotelDetails_ViewTitle","value":"تفاصيل الفندق"},{"key":"mob_hotelDetails_Book","value":"حجز"},{"key":"mob_hotelDetails_Tabs","value":"[\\ معلومات \\، \\ الدولة \\، \\ تقييم \\]"},{"key":"mob_hotelRoomBooking_ViewTitle","value":"حجز غرفة"},{"key":"mob_hotelRoomBooking_Book","value":"حجز"},{"key":"mob_hotelRoomBooking_Spend","value":"اصرف"},{"key":"mob_hotelRoomBooking_AvgNight","value":"معدل\/ الليلة"},{"key":"mob_hotelRoomBooking_MoreInfo","value":"معلومات الغرفة"},{"key":"mob_hotelDeliveryAddress_ViewTitle","value":"التفاصيل الشخصية"},{"key":"mob_hotelDeliveryAddress_Title","value":"أدخل تفاصيلك الشخصية"},{"key":"mob_hotelDeliveryAddress_Proceed","value":"واصل"},{"key":"mob_hotelBookingSummary_ViewTitle","value":"ملخص تفاصيل حجز الفندق"},{"key":"mob_hotelBookingSummary_PersonalDetails","value":"التفاصيل الشخصية"},{"key":"mob_hotelBookingSummary_HotelDetails","value":"تفاصيل الفندق"},{"key":"mob_hotelBookingSummary_Total","value":"المجموع"},{"key":"mob_hotelBookingSummary_Confirm","value":"تأكيد"},{"key":"mob_hotelPriceDetail_AvgNight","value":"معدل السعر بالليلة"},{"key":"mob_hotelPriceDetail_Taxes","value":"الضرائب"},{"key":"mob_hotelPriceDetail_Nights","value":"عدد الليالي"},{"key":"mob_hotelPriceDetail_Total","value":"المجموع"},{"key":"mob_car_ViewTitle","value":"السفر مع BLU"},{"key":"mob_car_CountryPlaceholder","value":"البلد"},{"key":"mob_car_CityPlaceholder","value":"المدينة"},{"key":"mob_car_LocationPlaceholder","value":"الموقع"},{"key":"mob_car_ReturnCar","value":"إعادة السيارة إلى الموقع ذاته"},{"key":"mob_car_PickUp","value":"مكان الاستقبال"},{"key":"mob_car_DropOff","value":"مكان التوصيل"},{"key":"mob_car_DriverAge","value":"السنّ بين 25 و70 عام؟"},{"key":"mob_car_Search","value":"بحث"},{"key":"mob_carsResults_ViewTitle","value":"نتائج البحث"},{"key":"mob_carsResults_Similar","value":"أو مشابه"},{"key":"mob_carsResults_TransmissionManual","value":"عادي"},{"key":"mob_carsResults_TransmissionAutomatic","value":"أوتوماتيك"},{"key":"mob_carsResults_ACOn","value":"مكيّف"},{"key":"mob_carsResults_ACOff","value":"غير مكيّف"},{"key":"mob_carDetails_ViewTitle","value":"تفاصيل السيارة"},{"key":"mob_carDetails_Spend","value":"اصرف"},{"key":"mob_carDetails_Similar","value":"أو مشابه"},{"key":"mob_carDetails_TransmissionManual","value":"عادي"},{"key":"mob_carDetails_TransmissionAutomatic","value":"أوتوماتيك"},{"key":"mob_carDetails_ACOn","value":"مكيّف"},{"key":"mob_carDetails_ACOff","value":"غير مكيّف"},{"key":"mob_carDetails_PickUp","value":"مكان الاستقبال"},{"key":"mob_carDetails_DropOff","value":"مكان التوصيل"},{"key":"mob_carDetails_TotalDays","value":"مجموع الأيام"},{"key":"mob_carDetails_Address","value":"العنوان"},{"key":"mob_carDeliveryAddress_ViewTitle","value":"التفاصيل الشخصية"},{"key":"mob_carDeliveryAddress_Title","value":"أدخل تفاصيلك الشخصية"},{"key":"mob_carDeliveryAddress_Proceed","value":"واصل"},{"key":"mob_carBookingSummary_ViewTitle","value":"حجز سيارة"},{"key":"mob_carBookingSummary_PersonalDetails ","value":"التفاصيل الشخصية"},{"key":"mob_carBookingSummary_CarDetails","value":"ملخص تفاصيل حجز السيارة"},{"key":"mob_carBookingSummary_Vehicle","value":"السيارة"},{"key":"mob_carBookingSummary_PickUp","value":"مكان الاستقبال"},{"key":"mob_carBookingSummary_PickUpLocation","value":"الموقع"},{"key":"mob_carBookingSummary_PickUpDate","value":"التاريخ"},{"key":"mob_carBookingSummary_DropOff","value":"مكان التوصيل"},{"key":"mob_carBookingSummary_DropOffLocation","value":"الموقع"},{"key":"mob_carBookingSummary_DropOffDate","value":"التاريخ"},{"key":"mob_carBookingSummary_Total","value":"المجموع"},{"key":"mob_carBookingSummary_Confirm","value":"تأكيد"},{"key":"mob_hotDeals_ViewTitle","value":"العروض المميزة"},{"key":"mob_hotDeals_Spend ","value":"اصرف"},{"key":"mob_hotDeals_Search","value":"بحث"},{"key":"mob_hotDealsProduct_ViewTitle","value":"منتج"},{"key":"mob_hotDealsProduct_Spend","value":"اصرف"},{"key":"mob_nearby_ViewTitle","value":"أماكن قريبة"},{"key":"mob_card_ViewTitle","value":"بطاقتي"},{"key":"mob_messages_ViewTitle","value":"صندوق الواردات"},{"key":"mob_messageDetail_ViewTitle","value":"رسالة"}]